/*---------------------------------------------------------------------------------

    Copyright (C) 2012-2024
        Alekmaul

    This software is provided 'as-is', without any express or implied
    warranty.  In no event will the authors be held liable for any
    damages arising from the use of this software.

    Permission is granted to anyone to use this software for any
    purpose, including commercial applications, and to alter it and
    redistribute it freely, subject to the following restrictions:

    1.	The origin of this software must not be misrepresented; you
        must not claim that you wrote the original software. If you use
        this software in a product, an acknowledgment in the product
        documentation would be appreciated but is not required.
    2.	Altered source versions must be plainly marked as such, and
        must not be misrepresented as being the original software.
    3.	This notice may not be removed or altered from any source
        distribution.

    Header checker / modifier for snes.
    Some parts are based on Snes mess driver.

---------------------------------------------------------------------------------*/

#include <ctype.h>
#include <memory.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "errors.h"

// DEFINES
#define SNESTOOLSVERSION __BUILD_VERSION
#define SNESTOOLSDATE __BUILD_DATE

#define LOROM_HEADER 0x7fc0
#define HIROM_HEADER 0xffc0
#define OFFSET_CHECKSUM 0x001c

    /*58*/ UNK,
    UNK,
    "Mindscape",
    "Romstar, Inc.",
    UNK,
    "Tradewest",
    UNK,
    "American Softworks Corp.",
    /*60*/ "Titus",
    "Virgin Interactive Entertainment",
    "Maxis",
    "Origin/FCI/Pony Canyon",
    UNK,
    UNK,
    UNK,
    "Ocean",
    /*68*/ UNK,
    "Electronic Arts",
    UNK,
    "Laser Beam",
    UNK,
    UNK,
    "Elite",
    "Electro Brain",
    /*70*/ "Infogrames",
    "Interplay",
    "LucasArts",
    "Parker Brothers",
    "Konami",
    "STORM",
    UNK,
    UNK,
    /*78*/ "THQ Software",
    "Accolade Inc.",
    "Triffix Entertainment",
    UNK,
    "Microprose",
    UNK,
    UNK,
    "Kemco",
    /*80*/ "Misawa",
    "Teichio",
    "Namco Ltd.",
    "Lozc",
    "Koei",
    UNK,
    "Tokuma Shoten Intermedia",
    "Tsukuda Original",
    /*88*/ "DATAM-Polystar",
    UNK,
    UNK,
    "Bullet-Proof Software",
    "Vic Tokai",
    UNK,
    "Character Soft",
    "I\'\'Max",
    /*90*/ "Takara",
    "CHUN Soft",
    "Video System Co., Ltd.",
    "BEC",
    UNK,
    "Varie",
    "Yonezawa / S'Pal Corp.",
    "Kaneco",
    /*98*/ UNK,
    "Pack in Video",
    "Nichibutsu",
    "TECMO",
    "Imagineer Co.",
    UNK,
    UNK,
    UNK,
    /*a0*/ "Telenet",
    "Hori",
    UNK,
    UNK,
    "Konami",
    "K.Amusement Leasing Co.",
    UNK,
    "Takara",
    /*a8*/ UNK,
    "Technos Jap.",
    "JVC",
    UNK,
    "Toei Animation",
    "Toho",
    UNK,
    "Namco Ltd.",
    /*b0*/ "Media Rings Corp.",
    "ASCII Co. Activison",
    "Bandai",
    UNK,
    "Enix America",
    UNK,
    "Halken",
    UNK,
    /*b8*/ UNK,
    UNK,
    "Culture Brain",
    "Sunsoft",
    "Toshiba EMI",
    "Sony Imagesoft",
    UNK,
    "Sammy",
    /*c0*/ "Taito",
    UNK,
    "Kemco",
    "Square",
    "Tokuma Soft",
    "Data East",
    "Tonkin House",
    UNK,
    /*c8*/ "KOEI",
    UNK,
    "Konami USA",
    "NTVIC",
    UNK,
    "Meldac",
    "Pony Canyon",
    "Sotsu Agency/Sunrise",
    /*d0*/ "Disco/Taito",
    "Sofel",
    "Quest Corp.",
    "Sigma",
    "Ask Kodansha Co., Ltd.",
    UNK,
    "Naxat",
    UNK,
    /*d8*/ "Capcom Co., Ltd.",
    "Banpresto",
    "Tomy",
    "Acclaim",
    UNK,
    "NCS",
    "Human Entertainment",
    "Altron",
    /*e0*/ "Jaleco",
    UNK,
    "Yutaka",
    UNK,
    "T&ESoft",
    "EPOCH Co.,Ltd.",
    UNK,
    "Athena",
    /*e8*/ "Asmik",
    "Natsume",
    "King Records",
    "Atlus",
    "Sony Music Entertainment",
    UNK,
    "IGS",
    UNK,
    /*f0*/ UNK,
    "Motown Software",
    "Left Field Entertainment",
    "Beam Software",
    "Tec Magik",
    UNK,
    UNK,
    UNK,
    /*f8*/ UNK,
    "Cybersoft",
    UNK,
    "Psygnosis",
    UNK,
    UNK,
    "Davidson",
    UNK,
};

// MACROS
#define HI_BYTE(n) (((int)n >> 8) & 0x00ff) // extracts the hi-byte of a word
#define LOW_BYTE(n) ((int)n & 0x00ff)       // extracts the low-byte of a word

#define HIGH(n) ((int)n << 8) // turn the char into high part of int

#pragma pack(1) // for bmp header to avoid data alignment

// STRUCTURES
typedef struct
{
    char extended[16];                  // extra information for header
                                        /*
                                        1	$00:FFB0	0x0081B0	2 bytes	Maker code
                                        2	$00:FFB2	0x0081B2	4 bytes	Game code
                                        3	$00:FFB6	0x0081B6	7 bytes	Fixed Value ($00)
                                        4	$00:FFBD	0x0081BD	1 byte	Expansion RAM size
                                        5	$00:FFBE	0x0081BE	1 byte	Special version
                                        6	$00:FFBF	0x0081BF	1 byte	Cartridge type
                                    */
    /*FFC0*/ char title[21];            // Name of the ROM, typically in ASCII, using spaces to pad the name to 21 bytes.
    /*FFD5*/ unsigned char romlayout;   // ROM layout, typically $20 for LoROM, or $21 for HiROM. Add $10 for FastROM.
    /*FFD6*/ unsigned char cardtype;    // Cartridge type, typically $00 for ROM only, or $02 for ROM with save-RAM.
    /*FFD7*/ unsigned char ROMsize;     // ROM size byte.
    /*FFD8*/ unsigned char SRAMsize;    // RAM size byte.
    /*FFD9*/ unsigned char countrycode; // Country code, which selects the video in the emulator. Values $00, $01, $0d use NTSC. Values in range $02..$0c use PAL. Other values are invalid.
    /*FFDA*/ unsigned char license;     // Licensee code. If this value is $33, then the ROM has an extended header with ID at $ffb2..$ffb5.
    /*FFDB*/ unsigned char version;     // Version number, typically $00.
    /*FFDC*/ unsigned short checksum_c; // Checksum complement, which is the bitwise-xor of the checksum and $ffff.
    /*FFDE*/ unsigned short checksum;   // SNES checksum, an unsigned 16-bit checksum of bytes.
    unsigned int unknow;                // Unknown.
    unsigned short cop_vecs;            // Table of interrupt vectors for native mode
    unsigned short brk_vecs;
    unsigned short abort_vecs;
    unsigned short nmi_vecs;
    unsigned short unused_vecs;
    unsigned short irq_vecs;
    unsigned int unknow1;     // Unknown.
    unsigned short ecop_vecs; // Table of interrupt vectors for emulation mode.
    unsigned short eunused_vecs;
    unsigned short eabort_vecs;
    unsigned short enmi_vecs;
    unsigned short ereset_vecs;
    unsigned short eirq_vecs;
} snes_header;

//// M A I N   V A R I A B L E S ////////////////////////////////////////////////
int quietmode     = 0; // 0 = not quiet, 1 = i can't say anything :P
int showheader    = 1; // 0 = don't display current header , 1 = display it
int fixcrc        = 0; // 1 = fix crc, 0 = don't fix it
